Информационная_база/src/Documents/РасходнаяНакладная/РасходнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасходнаяНакладная</name>
  <registerRecords>AccumulationRegister.ОстаткиНоменклатуры</registerRecords>
  <attributes>
    <name>СуммаПоДокументу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокНоменклатуры</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Информационная_база/src/AccumulationRegisters/ОстаткиНоменклатуры/ОстаткиНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиНоменклатуры</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DocumentRef.ПриходнаяНакладная</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Информационная_база/src/InformationRegisters/УчетнаяПолитика/УчетнаяПолитика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчетнаяПолитика</name>
  <informationRegisterPeriodicity>Year</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>МетодСписания</name>
    <type>
      <types>EnumRef.УчетнаяПолитика</types>
    </type>
  </resources>
</mdclass:InformationRegister>

Информационная_база/src/Enums/УчетнаяПолитика/УчетнаяПолитика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>УчетнаяПолитика</name>
  <enumValues>
    <name>ЛИФО</name>
  </enumValues>
  <enumValues>
    <name>ФИФО</name>
  </enumValues>
</mdclass:Enum>

Информационная_база/src/Documents/РасходнаяНакладная/ObjectModule.bsl
Процедура ОбработкаПроведения_Старая  (Отказ, Режим)
	
	
	 Движения.ОстаткиНоменклатуры.Записывать = Истина; 
	 Движения.Записать();
	
	
	Движения.ОстаткиНоменклатуры.Записывать = Истина; 
	
	 Блокировка= Новый БлокировкаДанных;
	 элементБлокировки  = Блокировка.Добавить("РегистрНакопления.ОстаткиНоменклатуры");
	 элементБлокировки.Режим=РежимБлокировкиДанных.Исключительный;
	 элементБлокировки.УстановитьЗначение("Склад",Склад);
	 элементБлокировки.ИсточникДанных=СписокНоменклатуры;
	 элементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура","Номенклатура");
	 Блокировка.Заблокировать();
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходнаяНакладнаяСписокНоменклатуры.Номенклатура КАК Номенклатура,
		|	СУММА(РасходнаяНакладнаяСписокНоменклатуры.Количество) КАК Количество
		|ПОМЕСТИТЬ ВТ_ТЧТовары
		|ИЗ
		|	Документ.РасходнаяНакладная.СписокНоменклатуры КАК РасходнаяНакладнаяСписокНоменклатуры
		|ГДЕ
		|	РасходнаяНакладнаяСписокНоменклатуры.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	РасходнаяНакладнаяСписокНоменклатуры.Номенклатура
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТЧТовары.Номенклатура КАК Номенклатура,
		|	ВТ_ТЧТовары.Количество КАК Количество,
		|	ЕСТЬNULL(ОстаткиНоменклатурыОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
		|	ВТ_ТЧТовары.Номенклатура.Представление КАК НоменклатураПредставление,
		|	ЕСТЬNULL(ОстаткиНоменклатурыОстатки.СтоимостьОстаток, 0) КАК СтоимостьОстаток
		|ИЗ
		|	ВТ_ТЧТовары КАК ВТ_ТЧТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиНоменклатуры.Остатки(
		|				&моментВремени,
		|				Номенклатура В
		|						(ВЫБРАТЬ
		|							ВТ_ТЧТовары.Номенклатура КАК Номенклатура
		|						ИЗ
		|							ВТ_ТЧТовары КАК ВТ_ТЧТовары)
		|					И Склад = &Склад) КАК ОстаткиНоменклатурыОстатки
		|		ПО ВТ_ТЧТовары.Номенклатура = ОстаткиНоменклатурыОстатки.Номенклатура";
	
	Запрос.УстановитьПараметр("моментВремени", моментВремени());
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Склад", Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		если выборка.Количество >	выборка.КоличествоОстаток тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "НЕ хвататет товарав "+ Выборка.НоменклатураПредставление ;
			Сообщение.Сообщить(); 
			отказ =Истина ;
			
		КонецЕсли; 
		
		если отказ Тогда
			Продолжить;	
		КонецЕсли;
		                       
		// регистр ОстаткиНоменклатуры Расход
				
		Движение = Движения.ОстаткиНоменклатуры.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = Выборка.Номенклатура;
		Движение.Склад = Склад;
		Движение.Количество = Выборка.Количество;
		если  Выборка.количество= Выборка.КоличествоОстаток   тогда
		себестоимость=Выборка.СтоимостьОстаток;	
		Иначе 
		себестоимость  =Выборка.Количество /Выборка.КоличествоОстаток*Выборка.СтоимостьОстаток;
		конецЕсли;
		движение.Стоимость=себестоимость;	
		
	КонецЦикла;
		
	КонецПроцедуры

Процедура ОбработкаПроведения_НоваяМетодика(Отказ, Режим)

	Запрос = Новый Запрос;
	МенеджерВТ=Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц=МенеджерВТ;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РасходнаяНакладнаяСписокНоменклатуры.Номенклатура КАК Номенклатура,
	|	СУММА(РасходнаяНакладнаяСписокНоменклатуры.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТ_ТЧТОвары
	|ИЗ
	|	Документ.РасходнаяНакладная.СписокНоменклатуры КАК РасходнаяНакладнаяСписокНоменклатуры
	|ГДЕ
	|	РасходнаяНакладнаяСписокНоменклатуры.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	РасходнаяНакладнаяСписокНоменклатуры.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТЧТОвары.Номенклатура КАК Номенклатура,
	|	ВТ_ТЧТОвары.Количество КАК Количество
	|ИЗ
	|	ВТ_ТЧТОвары КАК ВТ_ТЧТОвары";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Движение = Движения.ОстаткиНоменклатуры.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
		Движение.Склад = Склад;
		Движение.Количество = ВыборкаДетальныеЗаписи.Количество;
	КонецЦикла;
	
	Движения.ОстаткиНоменклатуры.Записывать = Истина; 
	Движения.ОстаткиНоменклатуры.БлокироватьДляИзменения=истина; 
	Движения.Записать();   
	
	
	
	Запрос = Новый Запрос;
	запрос.МенеджерВременныхТаблиц=МенеджерВТ;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОстаткиНоменклатурыОстатки.КоличествоОстаток КАК КоличествоОстаток,
	|	ОстаткиНоменклатурыОстатки.Номенклатура.Представление КАК НоменклатураПредставление,
	|	ОстаткиНоменклатурыОстатки.Склад КАК Склад
	|ИЗ
	|	РегистрНакопления.ОстаткиНоменклатуры.Остатки(
	|			&ДатаОстатков,
	|			Склад = &Склад
	|				И Номенклатура В
	|					(ВЫБРАТЬ
	|						ВТ_ТЧТОвары.Номенклатура КАК Номенклатура
	|					ИЗ
	|						ВТ_ТЧТОвары КАК ВТ_ТЧТОвары)) КАК ОстаткиНоменклатурыОстатки
	|ГДЕ
	|	ОстаткиНоменклатурыОстатки.КоличествоОстаток < 0";
	
	Запрос.УстановитьПараметр("ДатаОстатков", новый граница (МоментВремени(), видграницы.Включая));
	Запрос.УстановитьПараметр("Склад", Склад);
	
	Выборка = Запрос.Выполнить();
	
	
	если не Выборка.пустой() тогда   
		
		отказ =истина; 
		
		ВыборкаДетальныеЗаписи=Выборка.Выбрать();
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл      
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Недостаточно товара  " +ВыборкаДетальныеЗаписи.НоменклатураПредставление+" в кол-ве  "+ (-ВыборкаДетальныеЗаписи.КоличествоОстаток)  ;
			Сообщение.Сообщить();  
			
		КонецЦикла;
	
	конецесли 
		 
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ОстаткиНоменклатуры.Записывать = Истина; 
	Движения.Записать();
	
	
	Движения.ОстаткиНоменклатуры.Записывать = Истина; 
	
	 Блокировка= Новый БлокировкаДанных;
	 элементБлокировки  = Блокировка.Добавить("РегистрНакопления.ОстаткиНоменклатуры");
	 элементБлокировки.Режим=РежимБлокировкиДанных.Исключительный;
	 элементБлокировки.УстановитьЗначение("Склад",Склад);
	 элементБлокировки.ИсточникДанных=СписокНоменклатуры;
	 элементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура","Номенклатура");
	 Блокировка.Заблокировать();
	 
		Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходнаяНакладнаяСписокНоменклатуры.Номенклатура КАК Номенклатура,
		|	СУММА(РасходнаяНакладнаяСписокНоменклатуры.Количество) КАК Количество
		|ПОМЕСТИТЬ ВТ_ТЧТовары
		|ИЗ
		|	Документ.РасходнаяНакладная.СписокНоменклатуры КАК РасходнаяНакладнаяСписокНоменклатуры
		|ГДЕ
		|	РасходнаяНакладнаяСписокНоменклатуры.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	РасходнаяНакладнаяСписокНоменклатуры.Номенклатура
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТЧТовары.Номенклатура КАК Номенклатура,
		|	ВТ_ТЧТовары.Количество КАК Количество,
		|	ЕСТЬNULL(ОстаткиНоменклатурыОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
		|	ВТ_ТЧТовары.Номенклатура.Представление КАК НоменклатураПредставление,
		|	ЕСТЬNULL(ОстаткиНоменклатурыОстатки.СтоимостьОстаток, 0) КАК СтоимостьОстаток,
		|	ОстаткиНоменклатурыОстатки.Партия КАК Партия
		|ИЗ
		|	ВТ_ТЧТовары КАК ВТ_ТЧТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиНоменклатуры.Остатки(
		|				&моментВремени,
		|				Номенклатура В
		|						(ВЫБРАТЬ
		|							ВТ_ТЧТовары.Номенклатура КАК Номенклатура
		|						ИЗ
		|							ВТ_ТЧТовары КАК ВТ_ТЧТовары)
		|					И Склад = &Склад) КАК ОстаткиНоменклатурыОстатки
		|		ПО ВТ_ТЧТовары.Номенклатура = ОстаткиНоменклатурыОстатки.Номенклатура
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОстаткиНоменклатурыОстатки.Партия.МоментВремени
		|ИТОГИ
		|	МАКСИМУМ(Количество),
		|	СУММА(КоличествоОстаток)
		|ПО
		|	Номенклатура";
	
	Запрос.УстановитьПараметр("моментВремени", моментВремени());
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Склад", Склад); 
	
	ЗапросУП = Новый Запрос;
	ЗапросУП.Текст = 
		"ВЫБРАТЬ
		|	УчетнаяПолитикаСрезПоследних.МетодСписания КАК МетодСписания
		|ИЗ
		|	РегистрСведений.УчетнаяПолитика.СрезПоследних(&Дата, ) КАК УчетнаяПолитикаСрезПоследних";
		ЗапросУП.УстановитьПараметр("Дата", Дата);
	
	РезультатЗапросаУП = ЗапросУП.Выполнить().Выбрать();
 	РезультатЗапросаУП.Следующий();	
	МетодСписания=РезультатЗапросаУП.МетодСписания;
	
	если  МетодСписания=Перечисления.УчетнаяПолитика.ЛИФО тогда
	Запрос.Текст=СтрЗаменить(Запрос.Текст,"ОстаткиНоменклатурыОстатки.Партия.МоментВремени",	"ОстаткиНоменклатурыОстатки.Партия.МоментВремени УБЫВ");
    конецесли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока Выборка.Следующий() Цикл
		
		если выборка.Количество >	выборка.КоличествоОстаток тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "НЕ хвататет товарав "+ Выборка.НоменклатураПредставление ;
			Сообщение.Сообщить(); 
			отказ =Истина ;
			
		КонецЕсли; 
		
		если отказ Тогда
			Продолжить;	
		КонецЕсли;
		                       
		выборкаПоДетальнымЗаписям=Выборка.выбрать();
		// регистр ОстаткиНоменклатуры Расход
		ОстатокСписания=выборка.Количество;
		Пока выборкаПоДетальнымЗаписям.следующий() и ОстатокСписания<>0 цикл 
	
			
		Списать =Мин(	ОстатокСписания,выборкаПоДетальнымЗаписям.КоличествоОстаток);
		
		Движение = Движения.ОстаткиНоменклатуры.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = выборкаПоДетальнымЗаписям.Номенклатура;
		Движение.Склад = Склад;
		Движение.Количество = Списать; 
		Движение.Партия=выборкаПоДетальнымЗаписям.партия;
		
		ОстатокСписания=ОстатокСписания-Списать;   
					 
		если  выборкаПоДетальнымЗаписям.количество= выборкаПоДетальнымЗаписям.КоличествоОстаток   тогда
		себестоимость=выборкаПоДетальнымЗаписям.СтоимостьОстаток;	
		Иначе 
		себестоимость  =
		Списать /выборкаПоДетальнымЗаписям.КоличествоОстаток
		*выборкаПоДетальнымЗаписям.СтоимостьОстаток;
		конецЕсли;
		движение.Стоимость=себестоимость;	
		
		
		
		КонецЦикла;
	
		
				
	КонецЦикла;
 
КонецПроцедуры
